In [13]:
import pandas as pd
df = pd.read_csv(r'C:\Users\rajat.prakash\Desktop\Remote_repo\Data\New folder\Uber Drives 2016.csv')

In [15]:
df.head(5)

,START_DATE*,END_DATE*,CATEGORY*,START*,STOP*,MILES*,PURPOSE*
0,1/1/2016 21:11,1/1/2016 21:17,Business,Fort Pierce,Fort Pierce,5.1,Meal/Entertain
1,1/2/2016 1:25,1/2/2016 1:37,Business,Fort Pierce,Fort Pierce,5.0,NaN
2,1/2/2016 20:25,1/2/2016 20:38,Business,Fort Pierce,Fort Pierce,4.8,Errand/Supplies
3,1/5/2016 17:31,1/5/2016 17:45,Business,Fort Pierce,Fort Pierce,4.7,Meeting
4,1/6/2016 14:42,1/6/2016 15:49,Business,Fort Pierce,West Palm Beach,63.7,Customer Visit

In [34]:
filtered_data = df[(df['MILES*']>10) & (df['START*'] == 'New York')][['START_DATE*','END_DATE*','START*','PURPOSE*','MILES*']]
filtered_data

         START_DATE*        END_DATE*    START* PURPOSE*  MILES*
10   1/10/2016 15:08  1/10/2016 15:51  New York  Meeting    10.8
22   1/12/2016 16:02  1/12/2016 17:00  New York  Meeting    15.1
106  2/14/2016 16:35  2/14/2016 17:02  New York  Meeting    13.0
423  6/10/2016 15:19  6/10/2016 16:28  New York  Meeting    16.3

In [48]:
Start_date_filtered = df[(df['START_DATE*']  > str('1/3/2016')) & (df['START_DATE*'] < str('1/5/2016'))]
Start_date_filtered

,START_DATE*,END_DATE*,CATEGORY*,START*,STOP*,MILES*,PURPOSE*
59,1/30/2016 16:21,1/30/2016 16:33,Business,Cary,Apex,5.7,Errand/Supplies
60,1/30/2016 18:09,1/30/2016 18:24,Business,Apex,Cary,5.7,Customer Visit

In [51]:
data = df.loc[df['MILES*']>15,["START_DATE*",'PURPOSE*']]
data.head(5)

        START_DATE*        PURPOSE*
4    1/6/2016 14:42  Customer Visit
9   1/10/2016 12:17  Customer Visit
22  1/12/2016 16:02         Meeting
25  1/14/2016 16:29  Customer Visit
34  1/20/2016 10:36         Meeting

### Find out all the rides to Cary

In [54]:
city = df.loc[df['STOP*']=='Cary']
# Can ALso Write it in this way 
city

,START_DATE*,END_DATE*,CATEGORY*,START*,STOP*,MILES*,PURPOSE*
7,1/7/2016 13:27,1/7/2016 13:33,Business,Cary,Cary,0.8,Meeting
27,1/15/2016 0:41,1/15/2016 1:01,Business,Morrisville,Cary,8.0,Errand/Supplies
29,1/15/2016 13:26,1/15/2016 13:44,Business,Durham,Cary,10.4,Meal/Entertain
30,1/18/2016 14:55,1/18/2016 15:06,Business,Cary,Cary,4.8,Meal/Entertain
36,1/20/2016 13:25,1/20/2016 14:19,Business,Raleigh,Cary,40.2,Customer Visit
...,...,...,...,...,...,...,...
1048,12/13/2016 18:19,12/13/2016 18:29,Business,Cary,Cary,4.2,Errand/Supplies
1049,12/13/2016 20:20,12/13/2016 20:29,Business,Cary,Cary,4.1,Meal/Entertain
1050,12/14/2016 16:52,12/14/2016 17:10,Business,Cary,Cary,3.4,NaN
1051,12/14/2016 17:22,12/14/2016 17:34,Business,Cary,Cary,3.3,NaN
1053,12/14/2016 20:24,12/14/2016 20:40,Business,Morrisville,Cary,3.1,Customer Visit